AutB_MOD_02_Data_Structure/README_DE.md
```mermaid
stateDiagram-v2
    direction LR

    [*] --> Idle
    Idle --> MoveOne
    MoveOne --> MoveOneCheckDone
    MoveOneCheckDone --> MoveTwo
    MoveTwo --> MoveTwoCheckDone
    MoveTwoCheckDone --> ErrorStop
    ErrorStop --> Stopped
    Stopped --> [*]
```
