AutB_MOD_02_Data_Structure/puml/ENMotionStateMachineNoDefType.puml
@startuml

[*] --> Idle
Idle -> MoveOne
MoveOne -> MoveOneCheckDone
MoveOneCheckDone -> MoveTwo
MoveTwo -> MoveTwoCheckDone
MoveTwoCheckDone -> ErrorStop
ErrorStop -> Stopped
Stopped --> [*]

@enduml
